{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 52], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 52], "dtype": "float32", "input_dim": 34, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 52}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "s0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "name": "s0"}, "inbound_nodes": []}, {"name": "bidirectional_1", "class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "repeat_vector_1", "class_name": "RepeatVector", "config": {"name": "repeat_vector_1", "trainable": true, "n": 52}, "inbound_nodes": [[["s0", 0, 0, {}]], [["lstm_2", 0, 1, {}]], [["lstm_2", 1, 1, {}]], [["lstm_2", 2, 1, {}]], [["lstm_2", 3, 1, {}]], [["lstm_2", 4, 1, {}]], [["lstm_2", 5, 1, {}]], [["lstm_2", 6, 1, {}]], [["lstm_2", 7, 1, {}]], [["lstm_2", 8, 1, {}]], [["lstm_2", 9, 1, {}]], [["lstm_2", 10, 1, {}]], [["lstm_2", 11, 1, {}]], [["lstm_2", 12, 1, {}]], [["lstm_2", 13, 1, {}]], [["lstm_2", 14, 1, {}]], [["lstm_2", 15, 1, {}]], [["lstm_2", 16, 1, {}]], [["lstm_2", 17, 1, {}]], [["lstm_2", 18, 1, {}]], [["lstm_2", 19, 1, {}]], [["lstm_2", 20, 1, {}]], [["lstm_2", 21, 1, {}]], [["lstm_2", 22, 1, {}]], [["lstm_2", 23, 1, {}]], [["lstm_2", 24, 1, {}]], [["lstm_2", 25, 1, {}]], [["lstm_2", 26, 1, {}]], [["lstm_2", 27, 1, {}]], [["lstm_2", 28, 1, {}]], [["lstm_2", 29, 1, {}]], [["lstm_2", 30, 1, {}]], [["lstm_2", 31, 1, {}]], [["lstm_2", 32, 1, {}]], [["lstm_2", 33, 1, {}]], [["lstm_2", 34, 1, {}]], [["lstm_2", 35, 1, {}]], [["lstm_2", 36, 1, {}]], [["lstm_2", 37, 1, {}]], [["lstm_2", 38, 1, {}]], [["lstm_2", 39, 1, {}]], [["lstm_2", 40, 1, {}]], [["lstm_2", 41, 1, {}]], [["lstm_2", 42, 1, {}]], [["lstm_2", 43, 1, {}]], [["lstm_2", 44, 1, {}]], [["lstm_2", 45, 1, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 0, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 1, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 2, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 3, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 4, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 5, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 6, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 7, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 8, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 9, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 10, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 11, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 12, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 13, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 14, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 15, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 16, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 17, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 18, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 19, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 20, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 21, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 22, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 23, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 24, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 25, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 26, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 27, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 28, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 29, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 30, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 31, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 32, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 33, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 34, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 35, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 36, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 37, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 38, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 39, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 40, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 41, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 42, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 43, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 44, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 45, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 46, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 10, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]], [["concatenate_1", 1, 0, {}]], [["concatenate_1", 2, 0, {}]], [["concatenate_1", 3, 0, {}]], [["concatenate_1", 4, 0, {}]], [["concatenate_1", 5, 0, {}]], [["concatenate_1", 6, 0, {}]], [["concatenate_1", 7, 0, {}]], [["concatenate_1", 8, 0, {}]], [["concatenate_1", 9, 0, {}]], [["concatenate_1", 10, 0, {}]], [["concatenate_1", 11, 0, {}]], [["concatenate_1", 12, 0, {}]], [["concatenate_1", 13, 0, {}]], [["concatenate_1", 14, 0, {}]], [["concatenate_1", 15, 0, {}]], [["concatenate_1", 16, 0, {}]], [["concatenate_1", 17, 0, {}]], [["concatenate_1", 18, 0, {}]], [["concatenate_1", 19, 0, {}]], [["concatenate_1", 20, 0, {}]], [["concatenate_1", 21, 0, {}]], [["concatenate_1", 22, 0, {}]], [["concatenate_1", 23, 0, {}]], [["concatenate_1", 24, 0, {}]], [["concatenate_1", 25, 0, {}]], [["concatenate_1", 26, 0, {}]], [["concatenate_1", 27, 0, {}]], [["concatenate_1", 28, 0, {}]], [["concatenate_1", 29, 0, {}]], [["concatenate_1", 30, 0, {}]], [["concatenate_1", 31, 0, {}]], [["concatenate_1", 32, 0, {}]], [["concatenate_1", 33, 0, {}]], [["concatenate_1", 34, 0, {}]], [["concatenate_1", 35, 0, {}]], [["concatenate_1", 36, 0, {}]], [["concatenate_1", 37, 0, {}]], [["concatenate_1", 38, 0, {}]], [["concatenate_1", 39, 0, {}]], [["concatenate_1", 40, 0, {}]], [["concatenate_1", 41, 0, {}]], [["concatenate_1", 42, 0, {}]], [["concatenate_1", 43, 0, {}]], [["concatenate_1", 44, 0, {}]], [["concatenate_1", 45, 0, {}]], [["concatenate_1", 46, 0, {}]]]}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 47], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 1, "activation": "softmax_over_time", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]], [["dense_1", 1, 0, {}]], [["dense_1", 2, 0, {}]], [["dense_1", 3, 0, {}]], [["dense_1", 4, 0, {}]], [["dense_1", 5, 0, {}]], [["dense_1", 6, 0, {}]], [["dense_1", 7, 0, {}]], [["dense_1", 8, 0, {}]], [["dense_1", 9, 0, {}]], [["dense_1", 10, 0, {}]], [["dense_1", 11, 0, {}]], [["dense_1", 12, 0, {}]], [["dense_1", 13, 0, {}]], [["dense_1", 14, 0, {}]], [["dense_1", 15, 0, {}]], [["dense_1", 16, 0, {}]], [["dense_1", 17, 0, {}]], [["dense_1", 18, 0, {}]], [["dense_1", 19, 0, {}]], [["dense_1", 20, 0, {}]], [["dense_1", 21, 0, {}]], [["dense_1", 22, 0, {}]], [["dense_1", 23, 0, {}]], [["dense_1", 24, 0, {}]], [["dense_1", 25, 0, {}]], [["dense_1", 26, 0, {}]], [["dense_1", 27, 0, {}]], [["dense_1", 28, 0, {}]], [["dense_1", 29, 0, {}]], [["dense_1", 30, 0, {}]], [["dense_1", 31, 0, {}]], [["dense_1", 32, 0, {}]], [["dense_1", 33, 0, {}]], [["dense_1", 34, 0, {}]], [["dense_1", 35, 0, {}]], [["dense_1", 36, 0, {}]], [["dense_1", 37, 0, {}]], [["dense_1", 38, 0, {}]], [["dense_1", 39, 0, {}]], [["dense_1", 40, 0, {}]], [["dense_1", 41, 0, {}]], [["dense_1", 42, 0, {}]], [["dense_1", 43, 0, {}]], [["dense_1", 44, 0, {}]], [["dense_1", 45, 0, {}]], [["dense_1", 46, 0, {}]]]}, {"name": "embedding_2", "class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 44, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "dot_1", "class_name": "Dot", "config": {"name": "dot_1", "trainable": true, "axes": 1, "normalize": false}, "inbound_nodes": [[["dense_2", 0, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 1, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 2, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 3, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 4, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 5, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 6, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 7, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 8, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 9, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 10, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 11, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 12, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 13, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 14, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 15, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 16, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 17, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 18, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 19, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 20, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 21, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 22, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 23, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 24, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 25, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 26, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 27, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 28, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 29, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 30, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 31, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 32, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 33, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 34, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 35, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 36, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 37, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 38, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 39, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 40, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 41, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 42, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 43, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 44, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 45, 0, {}], ["bidirectional_1", 0, 0, {}]], [["dense_2", 46, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "axis": 2}, "inbound_nodes": [[["dot_1", 0, 0, {}], ["lambda_1", 0, 0, {}]], [["dot_1", 1, 0, {}], ["lambda_2", 0, 0, {}]], [["dot_1", 2, 0, {}], ["lambda_3", 0, 0, {}]], [["dot_1", 3, 0, {}], ["lambda_4", 0, 0, {}]], [["dot_1", 4, 0, {}], ["lambda_5", 0, 0, {}]], [["dot_1", 5, 0, {}], ["lambda_6", 0, 0, {}]], [["dot_1", 6, 0, {}], ["lambda_7", 0, 0, {}]], [["dot_1", 7, 0, {}], ["lambda_8", 0, 0, {}]], [["dot_1", 8, 0, {}], ["lambda_9", 0, 0, {}]], [["dot_1", 9, 0, {}], ["lambda_10", 0, 0, {}]], [["dot_1", 10, 0, {}], ["lambda_11", 0, 0, {}]], [["dot_1", 11, 0, {}], ["lambda_12", 0, 0, {}]], [["dot_1", 12, 0, {}], ["lambda_13", 0, 0, {}]], [["dot_1", 13, 0, {}], ["lambda_14", 0, 0, {}]], [["dot_1", 14, 0, {}], ["lambda_15", 0, 0, {}]], [["dot_1", 15, 0, {}], ["lambda_16", 0, 0, {}]], [["dot_1", 16, 0, {}], ["lambda_17", 0, 0, {}]], [["dot_1", 17, 0, {}], ["lambda_18", 0, 0, {}]], [["dot_1", 18, 0, {}], ["lambda_19", 0, 0, {}]], [["dot_1", 19, 0, {}], ["lambda_20", 0, 0, {}]], [["dot_1", 20, 0, {}], ["lambda_21", 0, 0, {}]], [["dot_1", 21, 0, {}], ["lambda_22", 0, 0, {}]], [["dot_1", 22, 0, {}], ["lambda_23", 0, 0, {}]], [["dot_1", 23, 0, {}], ["lambda_24", 0, 0, {}]], [["dot_1", 24, 0, {}], ["lambda_25", 0, 0, {}]], [["dot_1", 25, 0, {}], ["lambda_26", 0, 0, {}]], [["dot_1", 26, 0, {}], ["lambda_27", 0, 0, {}]], [["dot_1", 27, 0, {}], ["lambda_28", 0, 0, {}]], [["dot_1", 28, 0, {}], ["lambda_29", 0, 0, {}]], [["dot_1", 29, 0, {}], ["lambda_30", 0, 0, {}]], [["dot_1", 30, 0, {}], ["lambda_31", 0, 0, {}]], [["dot_1", 31, 0, {}], ["lambda_32", 0, 0, {}]], [["dot_1", 32, 0, {}], ["lambda_33", 0, 0, {}]], [["dot_1", 33, 0, {}], ["lambda_34", 0, 0, {}]], [["dot_1", 34, 0, {}], ["lambda_35", 0, 0, {}]], [["dot_1", 35, 0, {}], ["lambda_36", 0, 0, {}]], [["dot_1", 36, 0, {}], ["lambda_37", 0, 0, {}]], [["dot_1", 37, 0, {}], ["lambda_38", 0, 0, {}]], [["dot_1", 38, 0, {}], ["lambda_39", 0, 0, {}]], [["dot_1", 39, 0, {}], ["lambda_40", 0, 0, {}]], [["dot_1", 40, 0, {}], ["lambda_41", 0, 0, {}]], [["dot_1", 41, 0, {}], ["lambda_42", 0, 0, {}]], [["dot_1", 42, 0, {}], ["lambda_43", 0, 0, {}]], [["dot_1", 43, 0, {}], ["lambda_44", 0, 0, {}]], [["dot_1", 44, 0, {}], ["lambda_45", 0, 0, {}]], [["dot_1", 45, 0, {}], ["lambda_46", 0, 0, {}]], [["dot_1", 46, 0, {}], ["lambda_47", 0, 0, {}]]]}, {"name": "c0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "name": "c0"}, "inbound_nodes": []}, {"name": "lstm_2", "class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["concatenate_2", 0, 0, {}], ["s0", 0, 0, {}], ["c0", 0, 0, {}]], [["concatenate_2", 1, 0, {}], ["lstm_2", 0, 1, {}], ["lstm_2", 0, 2, {}]], [["concatenate_2", 2, 0, {}], ["lstm_2", 1, 1, {}], ["lstm_2", 1, 2, {}]], [["concatenate_2", 3, 0, {}], ["lstm_2", 2, 1, {}], ["lstm_2", 2, 2, {}]], [["concatenate_2", 4, 0, {}], ["lstm_2", 3, 1, {}], ["lstm_2", 3, 2, {}]], [["concatenate_2", 5, 0, {}], ["lstm_2", 4, 1, {}], ["lstm_2", 4, 2, {}]], [["concatenate_2", 6, 0, {}], ["lstm_2", 5, 1, {}], ["lstm_2", 5, 2, {}]], [["concatenate_2", 7, 0, {}], ["lstm_2", 6, 1, {}], ["lstm_2", 6, 2, {}]], [["concatenate_2", 8, 0, {}], ["lstm_2", 7, 1, {}], ["lstm_2", 7, 2, {}]], [["concatenate_2", 9, 0, {}], ["lstm_2", 8, 1, {}], ["lstm_2", 8, 2, {}]], [["concatenate_2", 10, 0, {}], ["lstm_2", 9, 1, {}], ["lstm_2", 9, 2, {}]], [["concatenate_2", 11, 0, {}], ["lstm_2", 10, 1, {}], ["lstm_2", 10, 2, {}]], [["concatenate_2", 12, 0, {}], ["lstm_2", 11, 1, {}], ["lstm_2", 11, 2, {}]], [["concatenate_2", 13, 0, {}], ["lstm_2", 12, 1, {}], ["lstm_2", 12, 2, {}]], [["concatenate_2", 14, 0, {}], ["lstm_2", 13, 1, {}], ["lstm_2", 13, 2, {}]], [["concatenate_2", 15, 0, {}], ["lstm_2", 14, 1, {}], ["lstm_2", 14, 2, {}]], [["concatenate_2", 16, 0, {}], ["lstm_2", 15, 1, {}], ["lstm_2", 15, 2, {}]], [["concatenate_2", 17, 0, {}], ["lstm_2", 16, 1, {}], ["lstm_2", 16, 2, {}]], [["concatenate_2", 18, 0, {}], ["lstm_2", 17, 1, {}], ["lstm_2", 17, 2, {}]], [["concatenate_2", 19, 0, {}], ["lstm_2", 18, 1, {}], ["lstm_2", 18, 2, {}]], [["concatenate_2", 20, 0, {}], ["lstm_2", 19, 1, {}], ["lstm_2", 19, 2, {}]], [["concatenate_2", 21, 0, {}], ["lstm_2", 20, 1, {}], ["lstm_2", 20, 2, {}]], [["concatenate_2", 22, 0, {}], ["lstm_2", 21, 1, {}], ["lstm_2", 21, 2, {}]], [["concatenate_2", 23, 0, {}], ["lstm_2", 22, 1, {}], ["lstm_2", 22, 2, {}]], [["concatenate_2", 24, 0, {}], ["lstm_2", 23, 1, {}], ["lstm_2", 23, 2, {}]], [["concatenate_2", 25, 0, {}], ["lstm_2", 24, 1, {}], ["lstm_2", 24, 2, {}]], [["concatenate_2", 26, 0, {}], ["lstm_2", 25, 1, {}], ["lstm_2", 25, 2, {}]], [["concatenate_2", 27, 0, {}], ["lstm_2", 26, 1, {}], ["lstm_2", 26, 2, {}]], [["concatenate_2", 28, 0, {}], ["lstm_2", 27, 1, {}], ["lstm_2", 27, 2, {}]], [["concatenate_2", 29, 0, {}], ["lstm_2", 28, 1, {}], ["lstm_2", 28, 2, {}]], [["concatenate_2", 30, 0, {}], ["lstm_2", 29, 1, {}], ["lstm_2", 29, 2, {}]], [["concatenate_2", 31, 0, {}], ["lstm_2", 30, 1, {}], ["lstm_2", 30, 2, {}]], [["concatenate_2", 32, 0, {}], ["lstm_2", 31, 1, {}], ["lstm_2", 31, 2, {}]], [["concatenate_2", 33, 0, {}], ["lstm_2", 32, 1, {}], ["lstm_2", 32, 2, {}]], [["concatenate_2", 34, 0, {}], ["lstm_2", 33, 1, {}], ["lstm_2", 33, 2, {}]], [["concatenate_2", 35, 0, {}], ["lstm_2", 34, 1, {}], ["lstm_2", 34, 2, {}]], [["concatenate_2", 36, 0, {}], ["lstm_2", 35, 1, {}], ["lstm_2", 35, 2, {}]], [["concatenate_2", 37, 0, {}], ["lstm_2", 36, 1, {}], ["lstm_2", 36, 2, {}]], [["concatenate_2", 38, 0, {}], ["lstm_2", 37, 1, {}], ["lstm_2", 37, 2, {}]], [["concatenate_2", 39, 0, {}], ["lstm_2", 38, 1, {}], ["lstm_2", 38, 2, {}]], [["concatenate_2", 40, 0, {}], ["lstm_2", 39, 1, {}], ["lstm_2", 39, 2, {}]], [["concatenate_2", 41, 0, {}], ["lstm_2", 40, 1, {}], ["lstm_2", 40, 2, {}]], [["concatenate_2", 42, 0, {}], ["lstm_2", 41, 1, {}], ["lstm_2", 41, 2, {}]], [["concatenate_2", 43, 0, {}], ["lstm_2", 42, 1, {}], ["lstm_2", 42, 2, {}]], [["concatenate_2", 44, 0, {}], ["lstm_2", 43, 1, {}], ["lstm_2", 43, 2, {}]], [["concatenate_2", 45, 0, {}], ["lstm_2", 44, 1, {}], ["lstm_2", 44, 2, {}]], [["concatenate_2", 46, 0, {}], ["lstm_2", 45, 1, {}], ["lstm_2", 45, 2, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_4", "class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_5", "class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_6", "class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_7", "class_name": "Lambda", "config": {"name": "lambda_7", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_8", "class_name": "Lambda", "config": {"name": "lambda_8", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_9", "class_name": "Lambda", "config": {"name": "lambda_9", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_10", "class_name": "Lambda", "config": {"name": "lambda_10", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_11", "class_name": "Lambda", "config": {"name": "lambda_11", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_12", "class_name": "Lambda", "config": {"name": "lambda_12", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_13", "class_name": "Lambda", "config": {"name": "lambda_13", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_14", "class_name": "Lambda", "config": {"name": "lambda_14", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_15", "class_name": "Lambda", "config": {"name": "lambda_15", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_16", "class_name": "Lambda", "config": {"name": "lambda_16", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_17", "class_name": "Lambda", "config": {"name": "lambda_17", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_18", "class_name": "Lambda", "config": {"name": "lambda_18", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_19", "class_name": "Lambda", "config": {"name": "lambda_19", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_20", "class_name": "Lambda", "config": {"name": "lambda_20", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_21", "class_name": "Lambda", "config": {"name": "lambda_21", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_22", "class_name": "Lambda", "config": {"name": "lambda_22", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_23", "class_name": "Lambda", "config": {"name": "lambda_23", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_24", "class_name": "Lambda", "config": {"name": "lambda_24", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_25", "class_name": "Lambda", "config": {"name": "lambda_25", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_26", "class_name": "Lambda", "config": {"name": "lambda_26", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_27", "class_name": "Lambda", "config": {"name": "lambda_27", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_28", "class_name": "Lambda", "config": {"name": "lambda_28", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_29", "class_name": "Lambda", "config": {"name": "lambda_29", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_30", "class_name": "Lambda", "config": {"name": "lambda_30", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_31", "class_name": "Lambda", "config": {"name": "lambda_31", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_32", "class_name": "Lambda", "config": {"name": "lambda_32", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_33", "class_name": "Lambda", "config": {"name": "lambda_33", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_34", "class_name": "Lambda", "config": {"name": "lambda_34", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_35", "class_name": "Lambda", "config": {"name": "lambda_35", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_36", "class_name": "Lambda", "config": {"name": "lambda_36", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_37", "class_name": "Lambda", "config": {"name": "lambda_37", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_38", "class_name": "Lambda", "config": {"name": "lambda_38", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_39", "class_name": "Lambda", "config": {"name": "lambda_39", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_40", "class_name": "Lambda", "config": {"name": "lambda_40", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_41", "class_name": "Lambda", "config": {"name": "lambda_41", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_42", "class_name": "Lambda", "config": {"name": "lambda_42", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_43", "class_name": "Lambda", "config": {"name": "lambda_43", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_44", "class_name": "Lambda", "config": {"name": "lambda_44", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_45", "class_name": "Lambda", "config": {"name": "lambda_45", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_46", "class_name": "Lambda", "config": {"name": "lambda_46", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_47", "class_name": "Lambda", "config": {"name": "lambda_47", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxgAAAB8AGQAZACFAnQAdABkARcAhQJmAhkAUwApAk7pAQAA\nACkB2gF0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xNy1kYzAwZGM3ODNmNjU+2gg8bGFt\nYmRhPhIAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 44, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_2", 0, 0, {}]], [["lstm_2", 1, 0, {}]], [["lstm_2", 2, 0, {}]], [["lstm_2", 3, 0, {}]], [["lstm_2", 4, 0, {}]], [["lstm_2", 5, 0, {}]], [["lstm_2", 6, 0, {}]], [["lstm_2", 7, 0, {}]], [["lstm_2", 8, 0, {}]], [["lstm_2", 9, 0, {}]], [["lstm_2", 10, 0, {}]], [["lstm_2", 11, 0, {}]], [["lstm_2", 12, 0, {}]], [["lstm_2", 13, 0, {}]], [["lstm_2", 14, 0, {}]], [["lstm_2", 15, 0, {}]], [["lstm_2", 16, 0, {}]], [["lstm_2", 17, 0, {}]], [["lstm_2", 18, 0, {}]], [["lstm_2", 19, 0, {}]], [["lstm_2", 20, 0, {}]], [["lstm_2", 21, 0, {}]], [["lstm_2", 22, 0, {}]], [["lstm_2", 23, 0, {}]], [["lstm_2", 24, 0, {}]], [["lstm_2", 25, 0, {}]], [["lstm_2", 26, 0, {}]], [["lstm_2", 27, 0, {}]], [["lstm_2", 28, 0, {}]], [["lstm_2", 29, 0, {}]], [["lstm_2", 30, 0, {}]], [["lstm_2", 31, 0, {}]], [["lstm_2", 32, 0, {}]], [["lstm_2", 33, 0, {}]], [["lstm_2", 34, 0, {}]], [["lstm_2", 35, 0, {}]], [["lstm_2", 36, 0, {}]], [["lstm_2", 37, 0, {}]], [["lstm_2", 38, 0, {}]], [["lstm_2", 39, 0, {}]], [["lstm_2", 40, 0, {}]], [["lstm_2", 41, 0, {}]], [["lstm_2", 42, 0, {}]], [["lstm_2", 43, 0, {}]], [["lstm_2", 44, 0, {}]], [["lstm_2", 45, 0, {}]], [["lstm_2", 46, 0, {}]]]}, {"name": "lambda_48", "class_name": "Lambda", "config": {"name": "lambda_48", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxwAAAB0AGoBfACDAX0AdABqAnwAZAVkBI0CfQB8AFMAKQZO\n6QEAAADpAAAAAOkCAAAAKQHaB3BhdHRlcm4pA3IBAAAAcgIAAAByAwAAACkD2gFL2gVzdGFja9oS\ncGVybXV0ZV9kaW1lbnNpb25zKQHaAXipAHIJAAAA+h88aXB5dGhvbi1pbnB1dC0xOC0xMTJiZjAw\nMDMyMzE+2hNzdGFja19hbmRfdHJhbnNwb3NlBwAAAHMGAAAAAAIKAQ4B\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_3", 0, 0, {}], ["dense_3", 1, 0, {}], ["dense_3", 2, 0, {}], ["dense_3", 3, 0, {}], ["dense_3", 4, 0, {}], ["dense_3", 5, 0, {}], ["dense_3", 6, 0, {}], ["dense_3", 7, 0, {}], ["dense_3", 8, 0, {}], ["dense_3", 9, 0, {}], ["dense_3", 10, 0, {}], ["dense_3", 11, 0, {}], ["dense_3", 12, 0, {}], ["dense_3", 13, 0, {}], ["dense_3", 14, 0, {}], ["dense_3", 15, 0, {}], ["dense_3", 16, 0, {}], ["dense_3", 17, 0, {}], ["dense_3", 18, 0, {}], ["dense_3", 19, 0, {}], ["dense_3", 20, 0, {}], ["dense_3", 21, 0, {}], ["dense_3", 22, 0, {}], ["dense_3", 23, 0, {}], ["dense_3", 24, 0, {}], ["dense_3", 25, 0, {}], ["dense_3", 26, 0, {}], ["dense_3", 27, 0, {}], ["dense_3", 28, 0, {}], ["dense_3", 29, 0, {}], ["dense_3", 30, 0, {}], ["dense_3", 31, 0, {}], ["dense_3", 32, 0, {}], ["dense_3", 33, 0, {}], ["dense_3", 34, 0, {}], ["dense_3", 35, 0, {}], ["dense_3", 36, 0, {}], ["dense_3", 37, 0, {}], ["dense_3", 38, 0, {}], ["dense_3", 39, 0, {}], ["dense_3", 40, 0, {}], ["dense_3", 41, 0, {}], ["dense_3", 42, 0, {}], ["dense_3", 43, 0, {}], ["dense_3", 44, 0, {}], ["dense_3", 45, 0, {}], ["dense_3", 46, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["s0", 0, 0], ["c0", 0, 0]], "output_layers": [["lambda_48", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}